Catalogs/Компьютеры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Catalog>
		<Properties>
			<Name>Компьютеры</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Актуальность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РежимыРаботы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаПользователей</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Устройство</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Компьютеры/Ext/ManagerModule.bsl
Функция НайтиКомпьютер(Имя) Экспорт
	
	// Поиск компьютера.
	УстановитьПривилегированныйРежим(Истина);
	
	Результат = Справочники.Компьютеры.НайтиПоКоду(Имя);
		
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Результат;
	
КонецФункции // НайтиКомпьютер()
	
Функция ЗарегестироватьКомпьютер(Имя, РежимРаботы, Устройство = Ложь) Экспорт
	
	// Поиск компьютера.
	Результат = НайтиКомпьютер(Имя);
	
	// Добавление компьютера.
	Если Не ЗначениеЗаполнено(Результат) Тогда
		УстановитьПривилегированныйРежим(Истина);
		
		ОбъектКомпьютер = Справочники.Компьютеры.СоздатьЭлемент();
		ОбъектКомпьютер.Код = Имя;
		ОбъектКомпьютер.РежимРаботы = РежимРаботы;
		ОбъектКомпьютер.Устройство = Устройство;
		ОбъектКомпьютер.Актуальность = ЗначениеЗаполнено(ОбъектКомпьютер.РежимРаботы);
		ОбъектКомпьютер.Записать();
		
		Результат = ОбъектКомпьютер.Ссылка;
		
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // ЗарегестироватьКомпьютер()


Процедура УстановитьПользователяКомпьютера(Ссылка, Пользователь, ГруппаПользователей) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Установка пользователя.
	Если (Ссылка = Ссылка.Ссылка) Тогда
		ОбъектКомпьютер = Ссылка.ПолучитьОбъект();
	Иначе
		ОбъектКомпьютер = Ссылка;
	КонецЕсли;
	
	ОбъектКомпьютер.Пользователь = Пользователь;
	ОбъектКомпьютер.ГруппаПользователей = ГруппаПользователей;
	ОбъектКомпьютер.Записать();
		
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры // УстановитьПользователяКомпьютера()

//Костенюк Александр-Старт 20.08.2012
//
// Функция подсчитывает количество актуальных компьютеров
//
// Параметры
//  Компьютер – Тип: СправочникСсылка.Компьютеры, компьютер, который не нужно учитывать 
//
// Возвращаемое значение: 
// Результат - Тип: Число, Неопределено. Количество актуальных компьютеров. 
//
Функция КоличествоАктуальныхКомпьютеров(Компьютер = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КОЛИЧЕСТВО(Компьютеры.Ссылка) КАК Количество
	               |ИЗ
	               |	Справочник.Компьютеры КАК Компьютеры
	               |ГДЕ
	               |	НЕ Компьютеры.ПометкаУдаления
	               |	И НЕ Компьютеры.ЭтоГруппа
	               |	И Компьютеры.Актуальность
	               |	И Компьютеры.Ссылка <> &Компьютер";
	Если Компьютер = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И Компьютеры.Ссылка <> &Компьютер", "");
	Иначе
		Запрос.УстановитьПараметр("Компьютер", Компьютер);
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Результат = Неопределено;
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Результат = Выборка.Количество;		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
//Костенюк Александр-Финиш 20.08.2012
